<?php
$regexName = '/^[A-Za-zàèìòùÀÈÌÒÙáéíóúýÁÉÍÓÚÝâêîôûÂÊÎÔÛãñõÃÑÕäëïöüÿÄËÏÖÜŸçÇßØøÅåÆæœ ]{2,24}+$/';
$regexText = '/^[A-Za-z0-9àèìòùÀÈÌÒÙáéíóúýÁÉÍÓÚÝâêîôûÂÊÎÔÛãñõÃÑÕäëïöüÿÄËÏÖÜŸçÇßØøÅåÆæœ\,\;\:\!\?\.\%\$\€\=\)\(\-\"\'\#\[\]\° ]+$/';
$regexDate = '/^[0-9]{4}\-[0-9]{2}\-[0-9]{2}\-/';
$regexMail = '/^[A-Za-z0-9._%+-]+[@]{1}[A-Za-z0-9.-]+[.]{1}[A-Za-z]{2,4}$/';
$regexAddress = '/^[A-Za-z0-9àèìòùÀÈÌÒÙáéíóúýÁÉÍÓÚÝâêîôûÂÊÎÔÛãñõÃÑÕäëïöüÿÄËÏÖÜŸçÇßØøÅåÆæœ\'\- ]+$/';
$regexPhoneNumber = '/^[0-9]+$/';
$regexAge = '/^[0-9]{1,2}$/';
?>